# ResList_AddCont

## Description
Adds a content location. The 'uniqueID' is a string identifier uniquely identifying this control.

```pascal
PROCEDURE ResList_AddCont(
				uniqueID   : STRING;
				folderSpec : INTEGER);
```

```python

def vs.ResList_AddCont(uniqueID, folderSpec):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|uniqueID|STRING||
|folderSpec|INTEGER||

## Version
Availability: from Vectorworks 2017
## Category
* Document List Handling